# BoltDiameterLongerFlange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionLAngle..::..BoltDiameterLongerFlange Property
StructuralSectionLAngle Class See Also
---
Maximum bolt hole diameter in the longer flange, in. (mm)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double BoltDiameterLongerFlange { get; set; }
```

Visual Basic
---
```text
Public Property BoltDiameterLongerFlange As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BoltDiameterLongerFlange {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace